Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMDA1_DFP/2.3.56/edc/ATSAMDA1E16B.PIC
      <edc:SFRDef edc:access="-nnnnnnn" edc:addr="0x41005129" edc:cname="EPINTENSET1" edc:impl="0x7F" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="USB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="TRCPT0" edc:desc="Transfer Complete 0 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRCPT1" edc:desc="Transfer Complete 1 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRFAIL0" edc:desc="Error Flow 0 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRFAIL1" edc:desc="Error Flow 1 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSTP" edc:desc="Received Setup Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALL0" edc:desc="Stall 0 In/out Interrupt enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALL1" edc:desc="Stall 1 In/out Interrupt enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-nnnnnnn" edc:addr="0x410051A9" edc:cname="EPINTENSET5" edc:impl="0x7F" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="USB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="TRCPT0" edc:desc="Transfer Complete 0 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRCPT1" edc:desc="Transfer Complete 1 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRFAIL0" edc:desc="Error Flow 0 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRFAIL1" edc:desc="Error Flow 1 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSTP" edc:desc="Received Setup Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALL0" edc:desc="Stall 0 In/out Interrupt enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALL1" edc:desc="Stall 1 In/out Interrupt enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnn-nnn" edc:addr="0x41005140" edc:cname="EPCFG2" edc:impl="0xF7" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="USB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="EPTYPE0" edc:desc="End Point Type0" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPTYPE1" edc:desc="End Point Type1" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="NYETDIS" edc:desc="NYET Token Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnn-nnn" edc:addr="0x410051C0" edc:cname="EPCFG6" edc:impl="0xF7" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="USB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="EPTYPE0" edc:desc="End Point Type0" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPTYPE1" edc:desc="End Point Type1" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="NYETDIS" edc:desc="NYET Token Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="wwww-www" edc:addr="0x41005144" edc:cname="EPSTATUSCLR2" edc:impl="0xF7" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="USB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="DTGLOUT" edc:desc="Data Toggle OUT Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DTGLIN" edc:desc="Data Toggle IN Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CURBK" edc:desc="Curren Bank Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQ0" edc:desc="Stall 0 Request Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQ1" edc:desc="Stall 1 Request Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BK0RDY" edc:desc="Bank 0 Ready Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BK1RDY" edc:desc="Bank 1 Ready Clear" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="wwww-www" edc:addr="0x410051C4" edc:cname="EPSTATUSCLR6" edc:impl="0xF7" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="USB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="DTGLOUT" edc:desc="Data Toggle OUT Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DTGLIN" edc:desc="Data Toggle IN Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CURBK" edc:desc="Curren Bank Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQ0" edc:desc="Stall 0 Request Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQ1" edc:desc="Stall 1 Request Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BK0RDY" edc:desc="Bank 0 Ready Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BK1RDY" edc:desc="Bank 1 Ready Clear" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="wwww-www" edc:addr="0x41005145" edc:cname="EPSTATUSSET2" edc:impl="0xF7" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="USB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="DTGLOUT" edc:desc="Data Toggle OUT Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DTGLIN" edc:desc="Data Toggle IN Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CURBK" edc:desc="Current Bank Set" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQ0" edc:desc="Stall 0 Request Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQ1" edc:desc="Stall 1 Request Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BK0RDY" edc:desc="Bank 0 Ready Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BK1RDY" edc:desc="Bank 1 Ready Set" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="wwww-www" edc:addr="0x410051C5" edc:cname="EPSTATUSSET6" edc:impl="0xF7" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="USB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="DTGLOUT" edc:desc="Data Toggle OUT Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DTGLIN" edc:desc="Data Toggle IN Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CURBK" edc:desc="Current Bank Set" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQ0" edc:desc="Stall 0 Request Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQ1" edc:desc="Stall 1 Request Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BK0RDY" edc:desc="Bank 0 Ready Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BK1RDY" edc:desc="Bank 1 Ready Set" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
